---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctInsulationType
source: html/96a17178-1b21-892f-364a-4be11b39b554.htm
---
# Autodesk.Revit.DB.Mechanical.DuctInsulationType

This class represents a duct insulation type in Autodesk Revit.

## Syntax (C#)
```csharp
public class DuctInsulationType : ElementType
```